src/InformationRegisters/KFK_ЗаданияКОбработкеОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>KFK_ЗаданияКОбработкеОчереди</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.KFK_СтатусыЗаданийОбработкиОчереди</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СлужебнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/KFK_ЗаданияКОбработкеОчереди/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(Идентификатор) Экспорт
	
	Набор = РегистрыСведений.ВИ_ЗаданияКОбработкеОчереди.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторОперации.Установить(Идентификатор);   
	Набор.Прочитать();
	Набор.Очистить();
	
	Запись = Набор.Добавить();
	Запись.ИдентификаторОперации = Идентификатор;  
	Запись.ДатаРегистрации = ТекущаяДатаСеанса();
	Запись.Статус = Перечисления.ВИ_СтатусыЗаданийОбработкиОчереди.ОжидаетОбработки;
	
	Набор.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьИнформациюОВыполненииЗадания(Идентификатор) Экспорт   
	
	Набор = РегистрыСведений.ВИ_ЗаданияКОбработкеОчереди.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторОперации.Установить(Идентификатор);   
	Набор.Прочитать(); 
	
	Для каждого Запись Из Набор Цикл
		Запись.Статус = Перечисления.ВИ_СтатусыЗаданийОбработкиОчереди.Завершено;
	КонецЦикла;         
	
	Набор.Записать();                 

КонецПроцедуры

#КонецОбласти //ПрограммныйИнтерфейс

#КонецЕсли
